{"services":[{"title":"Brand Design","icon":"brand-design.svg","body":"\n# Who you are.\n\nTwo important things about our approach to your Brand Identity. We listen, but\nwe are not order takers. We include you in the process 100%, but are not afraid\nto tell you when you are wrong. The result - the right aesthetic that is an\nhonest and true statement about who you are.\n\n## Brand Boards\n\nGuiceworks defines Brand via a set of style boards, which showcase options in\nfont, color palettes, photography, iconography and preliminary UI elements.\nGuiceworks presents several brand directions, each comprised of multiple boards\nworking together to communicate one potential look and feel for the Brand. From\nthere, Guiceworks works closely with client to narrow in on one final set of\nstyles to serve as the basis for the Brand and UI design. This approach\neliminates any surprises in UI design as all members are effectively working\nfrom the same “style guide”. This phase can be run simultaneously with the UX\nphase to maximize timelines if required.\n\n","id":"brand-design"},{"title":"Experience Design","icon":"experience-design.svg","body":"\n# Why you exist.\n\nInnovation lies at the intersection of what your end user desires, \nyour business demands, and technology can bring to life. We are adamant \nabout cutting to the chase of the most important experience for your \nmost important customer.\n\n## Discovery\n\nThis is a session with client to define the business goals and map the\nobjectives of the product. In this session, we seek to fully\nunderstand the business and the target, and challenge assumptions held by our\nteam and yours. The outcome of this meeting is alignment on the Minimum Viable\nProduct (MVP). We create an exhaustive list of prioritized features and draw a\nline in the sand for the minimum set to deliver value and prove viability in the\nmarketplace. \n\n## Flow Architecture\n\nWhether it’s a whiteboard, sketchbook or napkin, we believe in whatever it takes\nto get the ideas out quickly to keep the conversation moving. In this phase, we\nwork with relevant stakeholders/team members to sketch initial ideas for the\noverall user experience. We focus on the most important needs for the most\nimportant target groups of the product. This exercise solidifies the team’s\nunderstanding of MVP and ensures we are capturing all the major use cases,\nas well as mapping strategically against business goals. With visual sketching,\nwe can identify major roadblocks in the experience early and at low cost.\n\n## Sketch\n\nWhether it’s a whiteboard, sketchbook or napkin, we believe in whatever it takes\nto get the ideas out quickly to keep the conversation moving. In this phase, we\nwork with relevant stakeholders/team members to sketch initial ideas for the\noverall user experience. We focus on the most important needs for the most\nimportant target groups of the product. This exercise solidifies the team’s\nunderstanding of the MVP and ensures we are capturing all the major use cases,\nas well as mapping strategically against business goals. With visual sketching,\nwe can identify major roadblocks in the experience early and at low cost.\n\n## Prototype\n\nHere, we bring the sketch and user flows to life via higher fidelity and\nclickable wire frames. In some cases, we may layer on a bit of brand design just\nto make the experience feel dynamic enough to test legitimately with a set of\npotential users. The clickable prototype invokes a common ground for\nstakeholders, developers and designers to accurately communicate expectations\nand generate ideas on something that feels more like a “real product”.\nPrototyping leverages desktop, tablet and mobile presentations to fully vet\nfeatures in their proper context.\n\n","id":"experience-design"},{"title":"Front-end Engineering","icon":"front-end.svg","body":"\n# How it works.\n\nThese design systems ultimately need to be translated into working code that\nruns across various devices. This is a critical phase in the process where too\noften the design language, UX and branding get lost in the complexity of\ndevelopment. At Guiceworks, we help narrow the gap between design and\ndevelopment to ensure the implementation reflects the established brand and\nvisual language.\n\n\n\n## Deliverables\n\nWe can provide highly-composable, responsive UI components and front-end\ntemplates for integration with existing or new desktop and mobile applications.\nWe'll work with your team to ensure proper translation of the visual systems put\nin place through the design process and help them deliver pixel perfect\nimplementations across devices. We also provide front-end team augmentation\nalong with full working prototypes and initial builds for MVP releases.\n","id":"front-end-engineering"},{"title":"Graphic Design","icon":"graphic-design.svg","body":"\n# How you look.\n\nLess is more. We treat graphic design with a mindset that focuses on the least\namount of design to communicate effectively with the user. Inherent in this\napproach is a simple but stunning beauty for everything from the product to the\nbrand to all the minute interactions in between.\n\n","id":"graphic-design"},{"title":"Interface Design","icon":"interface-design.svg","body":"\n# How you interact.\n\nThis is ultimately where you make or break the experience for a user and the\nbusiness. Great UI Design is a seamless manifestation of Brand, UX and Graphic\nDesign. At Guiceworks, we are well versed in the development process and work\none-on-one with developers to correctly translate even the smallest design\ndetails to a fluid user interface. Working from the approved style boards, UI\ndesign is where we bring the work to date together under one intelligent and\nbeautiful execution. \n\n## Prototype\n\nPrototype in context of UI design. UI always presented in prototype to get as\n“real” of experience as possible. Can test at this point on some things, more\naccurate to make decision about. Prototype in context of UI design. UI always\npresented in prototype to get as “real” of experience as possible. Can test at\nthis point on some things, more accurate to make decision about. Prototype in\ncontext of UI design. UI always presented in prototype to get as “real” of\nexperience as possible. Can test at this point on some things, more accurate to\nmake decision about. \n","id":"interface-design"}]}